<?php

return [
    /*
     * 项目编号自增初始值
     */
    'division_num' => [
        '1' => '001',
        '2' => '001',
        '3' => '001'
    ],

    /*
     * 项目类别
     */
    'category' => [
        '1' => '施工招标代理',
        '2' => '设计招标代理',
        '3' => '勘察招标代理',
        '4' => '监理招标代理',
        '5' => '编制投资估算',
        '6' => '编制设计概算',
        '7' => '编制施工图预算',
        '8' => '编制工程量清单',
        '9' => '编制招标控制价',
        '10'=> '全过程造价控制',
        '11'=> '竣工结算审核',
        '12'=> '政府采购代理',
        '13'=> '其他：'
    ],

    /*
     * 项目分工
     */
    'position' => [
        '1' => '项目负责人_招标',
        '2' => '项目负责人_咨询',
        '3' => '业务助理_招标',
        '4' => '业务助理_咨询',
        '5' => '项目审核人_招标',
        '6' => '项目审核人_咨询',
        '7' => '项目经营人',
        '8' => '专业工程师_土建部分',
        '9' => '专业工程师_招标部分',
        '10'=> '专业工程师_安装部分',
        '11'=> '专业工程师_市政部分',
        '12'=> '专业工程师_绿化部分',
        '13'=> '专业工程师_其他部分'
    ],

    /*
     * 项目状态
     */
    'state' => [
        '已保存',
        '已下单',
        '已收款',
        '已归档',
        '已申请奖金结算',
        '已分配奖金',
        '已确认奖金',
        '已审查',
        '已终审'
    ],

    /*
     * 职位部门
     */
    'post' => [
        '1' => '部门经理',
        '2' => '财务',
        '3' => '归档室',
        '4' => '项目负责人',
        '5' => '部门经理',
        '6' => '项目负责人',
        '7' => '副总经理',
//        '7' => '总师室',
        '8' => '总经理'
    ],

    /*
     * 流转操作
     */
    'operate' => [
        '1' => '发起',
        '2' => '收款',
        '3' => '归档',
        '4' => '申请结算',
        '5' => '奖金分配',
        '6' => '确认',
        '7' => '审查',
        '8' => '终审'
    ],

    /*
     * 流转结果
     */
    'result' => [
        '1' => '项目录入',
        '2' => '收款完成',
        '3' => '归档完成',
        '4' => '申请完成',
        '5' => '分配完成',
        '6' => '确认通过',
        '7' => '审查通过',
        '8' => '终审同意'
    ]

];